app/Controllers/Clientes.php

SELECT *
FROM `Clientes`
---
    public function mostrar(){
        $clienteModel = model('ClienteModel');
        $data['clientes'] = $clienteModel->findAll();