app/Controllers/Compras.php

    public function mostrar(){
        $comprasModel = model('ComprasModel');
        $data['compras'] = $comprasModel->findAll();
---
SELECT *
FROM `Compras`

    public function agregar(){
        helper(['form', 'url']);
        $productoModel = model('ProductoModel');
        $proveedorModel = model('ProveedorModel');
        $empleadoModel = model('EmpleadoModel');

        $data['productos'] =$productoModel->findAll();
        $data['proveedores'] = $proveedorModel->findAll();
        $data['empleados'] = $empleadoModel->findAll();
---
SELECT *
FROM `Productos`
SELECT *
FROM `Proveedores`
SELECT *
FROM `Empleados`

    public function insert()
{
    $comprasModel = model('ComprasModel');
    $productoModel = model('ProductoModel');

    $nombreProducto = $_POST['nombreProducto'];
    $compraTotal = $_POST['compraTotal'];
    $fechaCompra = $_POST['fechaCompra'];

    // Obtener el producto existente
    $productoExistente = $productoModel->where('nombreProducto', $nombreProducto)->first();

    if ($productoExistente) {
        // Actualizar la cantidad del producto existente
        $nuevaCantidad = $productoExistente->productoTotal + $compraTotal;

        // Actualizar el producto existente en la base de datos
        $productoModel->update($productoExistente->idProducto, ['productoTotal' => $nuevaCantidad, 'fechaCompra' => $fechaCompra]);
---
SELECT *
FROM `Productos`
WHERE `nombreProducto` = 'Smark Sumifix Supra-blue 2'
 LIMIT 1
UPDATE `Productos` SET `productoTotal` = 46, `fechaCompra` = '2023-12-06'
WHERE `Productos`.`idProducto` IN ('6')

        "numeroSeguimiento" => bin2hex(random_bytes(15))
    ];

    $comprasModel->insert($data, false);
---
INSERT INTO `Compras` (`nombreProducto`, `proveedor`, `precio`, `empleado`, `compraTotal`, `fechaCompra`, `numeroSeguimiento`) VALUES ('Smark Sumifix Supra-blue 2', 'Quimicef', '212.1', 'José Roberto', '12', '2023-12-06', '0156dc263d78a4b48c825a5325f160')