app/Controllers/Empleado.php

    public function mostrar(){
        $empleadoModel = model('EmpleadoModel');
        $data['empleados'] = $empleadoModel->findAll();
---
SELECT *
FROM `Empleados`