app/Controllers/Home.php

SELECT *
FROM `Empleados`
WHERE `nombre` = 'José Roberto'
AND `contraseña` = 'Jose2023'
---
    public function index()
    {
        $data['title'] = "Empleado";
        $validation =  \Config\Services::validation();

        if (session()->get('idEmpleado')) {
            // Usuario ya autenticado, redirigir a la página deseada
            return redirect()->to('Admin/Menu_Inicio/Inicio');
        }

        if (strtolower($this->request->getMethod()) === 'post') {
            $rules = [
                'nombre' => 'required',
                'contraseña' => 'required',
                'rol'=>'required'
            ];

            if (!$this->validate($rules)) {
                return view('Admin/Inicio/home');
            }

            $nombre = $this->request->getPost('nombre');
            $contraseña = $this->request->getPost('contraseña');
            $empleadoModel = model('EmpleadoModel');
            $usuario = $empleadoModel->where('nombre', $nombre)
                                   ->where('contraseña', $contraseña)
                                   ->findAll();