app/Controllers/Inicio.php

    public function index()
    {
        $empleadoModel = model('EmpleadoModel');
        $data['empleados'] = $empleadoModel->findAll();
---
SELECT *
FROM `Empleados`