app/Controllers/Producto.php

    public function mostrar(){
        $productoModel = model('ProductoModel');
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `Productos`

    public function agregar(){
        helper(['form', 'url']);
        $comprasModel = model('ComprasModel');
        $proveedorModel = model('ProveedorModel');
        $empleadoModel = model('EmpleadoModel');

        $data['compras'] =$comprasModel->findAll();
        $data['proveedores'] = $proveedorModel->findAll();
        $data['empleados'] = $empleadoModel->findAll();
---
SELECT *
FROM `Compras`
SELECT *
FROM `Proveedores`
SELECT *
FROM `Empleados`

    public function editar($idProducto){
        $productoModel = model('ProductoModel');
            $data['productos'] = $productoModel->find($idProducto);
---
SELECT *
FROM `Productos`
WHERE `Productos`.`idProducto` = '1'

    public function buscar(){
        $productoModel = model('ProductoModel');
        if(isset($_GET['nombreProducto'])){
            $nombreProducto =$_GET['nombreProducto'];
            $data['productos'] = $productoModel->like('nombreProducto',$nombreProducto)->findAll();

        }
        else{
            $nombreProducto = "";
            $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `Productos`