app/Controllers/Proveedor.php

    public function mostrar(){
        $proveedorModel = model('ProveedorModel');
        $data['proveedores'] = $proveedorModel->findAll();
---
SELECT *
FROM `Proveedores`