app/Controllers/Ventas.php

SELECT *
FROM `Ventas`
---
    public function mostrar(){
        $ventaModel = model('VentasModel');
        $data['ventas'] = $ventaModel->findAll();

SELECT *
FROM `Productos`
SELECT *
FROM `Clientes`
SELECT *
FROM `Empleados`
---
    public function agregar(){
        helper(['form', 'url']);
        $productoModel = model('ProductoModel');
        $clienteModel = model('ClienteModel');
        $empleadoModel = model('EmpleadoModel');

        $data['productos'] =$productoModel->findAll();
        $data['clientes'] = $clienteModel->findAll();
        $data['empleados'] = $empleadoModel->findAll();